//==============================================
//
// バレットの処理
// Author : Sato Teruto
//
//==============================================

//----------------------------
// インクルード
//----------------------------
#include "bullet.h"

//====================================
// コンストラクタ
//====================================
CBullet::CBullet() : CBillBoard(0)
{
}
CBullet::CBullet(int nPriority) : CBillBoard(nPriority)
{

}

//====================================
// デストラクタ
//====================================
CBullet::~CBullet()
{

}

//====================================
// 初期化
//====================================
HRESULT CBullet::Init(D3DXVECTOR3 pos)
{
	CBillBoard::Init(pos);

	return S_OK;
}

//====================================
// 終了
//====================================
void CBullet::Uninit()
{
	CBillBoard::Uninit();
}

//====================================
// 更新
//====================================
void CBullet::Update()
{
	CBillBoard::Update();

	//位置に移動量を加算
	m_pos += m_move;
	CBillBoard::SetPos(m_pos);
}

//====================================
// 描画
//====================================
void CBullet::Draw()
{
	CBillBoard::Draw();
}