//===================================================
//
// リザルトヘッダー
// Author : Sato Teruto
//
//===================================================
#ifndef _RESULT_H_
#define _RESULT_H_	

//-------------------------------
// インクルード
//--------------------------------
#include <d3dx9.h>

//--------------------------------
// 前方宣言
//--------------------------------
class CBg;			//背景
class CRanking;		//ランキング

//================================
// リザルトクラスの定義
//================================
class CResult
{
public:
	CResult();	//コンストラクタ
	~CResult();	//デストラクタ

	//------------------
	// メンバ関数
	//------------------
	HRESULT Init();
	void Uninit();
	void Update();

private:
	//------------------
	// メンバ変数
	//------------------
	CBg* m_pBg;				//背景
	CRanking* m_pRanking;	//ランキング
};

#endif