//=============================================================
//
// ステージの処理
// Author : Sato Teruto
//
//=============================================================

//--------------------------
// インクルード
//--------------------------
#include "stage.h"

//=========================================
// コンストラクタ
//=========================================
CStage::CStage()
{

}

//=========================================
// デストラクタ
//=========================================
CStage::~CStage()
{

}

//=========================================
// 初期化
//=========================================
HRESULT CStage::Init(D3DXVECTOR3 pos)
{
	CObjectX::Init(pos);

	CObjectX::SetFireName(m_text);

	return S_OK;
}

//=========================================
// 終了
//=========================================
void CStage::Uninit()
{
	CObjectX::Uninit();
}

//=========================================
// 更新
//=========================================
void CStage::Update()
{
	CObjectX::Update();
}

//=========================================
// 描画
//=========================================
void CStage::Draw()
{
	CObjectX::Draw();
}

//=========================================
// 生成
// 引数：モデルのパス、位置
//=========================================
CStage* CStage::Create(LPCTSTR text, D3DXVECTOR3 pos)
{
	CStage *pStage = nullptr;

	//-----------------------------------------
	// 生成と初期化
	//-----------------------------------------
	pStage = new CStage;	//生成

	if (pStage != nullptr)
	{//NULLチェック
		//初期化
		pStage->m_text = text;
		pStage->Init(pos);
		//pStage->SetObjType(OBJTYPE_PLAYER);
	}

	return pStage;
}