//===================================================
//
// チュートリアルヘッダー
// Author : Sato Teruto
//
//===================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_	

//-------------------------------
// インクルード
//--------------------------------
#include <d3dx9.h>

//--------------------------------
// 前方宣言
//--------------------------------
class CBg;			//背景

//================================
// チュートリアルクラスの定義
//================================
class CTutorial
{
public:
	//背景の種類
	enum TYPE
	{
		TYPE_MANUAL = 0,
		TYPE_TUTORIAL1,
		TYPE_TUTORIAL2,
		TYPE_GAME,
		TYPE_MAX
	};

	CTutorial();	//コンストラクタ
	~CTutorial();	//デストラクタ

	//------------------
	// メンバ関数
	//------------------
	HRESULT Init();
	void Uninit();
	void Update();

private:
	//------------------
	// 定数
	//------------------
	static const int nMaxBg = 3;	//背景の最大数

	//------------------
	// メンバ変数
	//------------------
	int m_nNumber;			//番号
	CBg* m_pBg[nMaxBg];		//背景
};

#endif